In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
df = pd.read_csv('Advanced_house_price.csv', usecols=['BsmtQual','FireplaceQu','GarageType','SalePrice'])
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice
0       Gd         NaN     Attchd     208500
1       Gd          TA     Attchd     181500
2       Gd          TA     Attchd     223500
3       TA          Gd     Detchd     140000
4       Gd          TA     Attchd     250000

In [8]:
df.isnull().sum()

BsmtQual        37
FireplaceQu    690
GarageType      81
SalePrice        0
dtype: int64

In [9]:
## Adding new variable
df['BsmtQual_var']= np.where(df['BsmtQual'].isnull(),1,0)

In [10]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice  BsmtQual_var
0       Gd         NaN     Attchd     208500             0
1       Gd          TA     Attchd     181500             0
2       Gd          TA     Attchd     223500             0
3       TA          Gd     Detchd     140000             0
4       Gd          TA     Attchd     250000             0

In [16]:
## Replacing with most frequent category
##1. First finding the most frquent categories
df['BsmtQual'].mode()[0]

'TA'

In [17]:
frequent =df['BsmtQual'].mode()[0]

In [18]:
df['BsmtQual'].fillna(frequent, inplace=True)

In [19]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice  BsmtQual_var
0       Gd         NaN     Attchd     208500             0
1       Gd          TA     Attchd     181500             0
2       Gd          TA     Attchd     223500             0
3       TA          Gd     Detchd     140000             0
4       Gd          TA     Attchd     250000             0

In [20]:
df['FireplaceQu_var']= np.where(df['FireplaceQu'].isnull(),1,0)# creting new variable
frequent=df['FireplaceQu'].mode()[0] # finding the frequent value
df['FireplaceQu'].fillna(frequent, inplace=True)# capturing the importnace of nan values

In [21]:
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice  BsmtQual_var  FireplaceQu_var
0       Gd          Gd     Attchd     208500             0                1
1       Gd          TA     Attchd     181500             0                0
2       Gd          TA     Attchd     223500             0                0
3       TA          Gd     Detchd     140000             0                0
4       Gd          TA     Attchd     250000             0                0

## Most frequent used technique
- Suppose if you have more frequent categories, we just replace NaN with a new category

In [28]:
df = pd.read_csv('Advanced_house_price.csv', usecols=['BsmtQual','FireplaceQu','GarageType','SalePrice'])
df.head()

  BsmtQual FireplaceQu GarageType  SalePrice
0       Gd         NaN     Attchd     208500
1       Gd          TA     Attchd     181500
2       Gd          TA     Attchd     223500
3       TA          Gd     Detchd     140000
4       Gd          TA     Attchd     250000

In [32]:
def impute_nan(df,variable):
    df[variable+'newVar']=np.where(df[variable].isnull(),'Missing',df[variable])

In [33]:
for feature in ['BsmtQual','FireplaceQu','GarageType']:
    impute_nan(df,feature)

In [34]:
df.head()

,BsmtQual,FireplaceQu,GarageType,SalePrice,BsmtQualnewVar,FireplaceQunewVar,GarageTypenewVar
0,Gd,NaN,Attchd,208500,Gd,Missing,Attchd
1,Gd,TA,Attchd,181500,Gd,TA,Attchd
2,Gd,TA,Attchd,223500,Gd,TA,Attchd
3,TA,Gd,Detchd,140000,TA,Gd,Detchd
4,Gd,TA,Attchd,250000,Gd,TA,Attchd

- We drop the old features

In [36]:
df= df.drop(['BsmtQual','FireplaceQu','GarageType'],axis=1)

In [37]:
df.head()

   SalePrice BsmtQualnewVar FireplaceQunewVar GarageTypenewVar
0     208500             Gd           Missing           Attchd
1     181500             Gd                TA           Attchd
2     223500             Gd                TA           Attchd
3     140000             TA                Gd           Detchd
4     250000             Gd                TA           Attchd